Documents/ПриостановкаИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриостановкаИзделияКомплект</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГлабольныеСостояниеКомплекта</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияКомплект</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеКомплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ГлабольныеСостояниеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГлабольныеСостояниеКомплекта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлобальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадачаДляБлокировки</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтадияТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПриостановкаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧ_Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаЗадачаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажПередача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеГЧ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоенНомерPDM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоМалярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОгрузкаЧастичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПодрядчик2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСтолярка3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазработкаРКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД_ожидание_согласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнешнееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВнутреннееОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТЗРекламация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриостановкаИзделияКомплект/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
    ТаблицаСтатусов 			= ПолучитьТекущиеСтатусы(ИзделияКомплект);
	ТаблицаПроводок 			= ПолучитьТаблицуПроведения();
	
	СтруктураТаблиц = Новый Структура("ТаблицаСтатусов, ТаблицаПроводок" 
	                                    ,ТаблицаСтатусов
	                                    ,ТаблицаПроводок
										);
	
	
	Для каждого ТекущийКомплект Из ИзделияКомплект Цикл
		
		РасчитатьКомплект(СтруктураТаблиц, ТекущийКомплект.ИзделиеКомплект);
	
	КонецЦикла;
	
	Движения.ГлабольныеСостояниеКомплекта.Записывать = Истина;
	Для Каждого ТекСтрокаПроводки Из ТаблицаПроводок Цикл
		Движение = Движения.ГлабольныеСостояниеКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПроводки);
		Движение.Период 			= ДатаПриостановки;
		Движение.ГлобальныйСтатус 	= Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы;
		
		омСтадииКомплекта.УстановитьГлобальныйСтатусСУчетомРаботыКонструктора(ТекСтрокаПроводки.Комплект
													, Перечисления.СтатусыЗадач.ГлобальнаяПриостановкаРаботы
													, ДатаПриостановки
													, Автор
													, Комментарий);
		
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьТаблицуПроведения()

	МасиивТипов = Новый Массив;
	МасиивТипов.Добавить(Тип("СправочникСсылка.ИзделияКомплект"));
	МасиивТипов.Добавить(Тип("СправочникСсылка.Композиции"));
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов(МасиивТипов));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	ТаблицаПроводок.Колонки.Добавить("ПредыдущийТипЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования"));
	
	Возврат ТаблицаПроводок;

КонецФункции // ПолучитьТаблицуПроведения()

Процедура РасчитатьКомплект(СтруктураТаблиц, Комплект)

	ТаблицаСтатусов = СтруктураТаблиц.ТаблицаСтатусов;
	ТаблицаПроводок = СтруктураТаблиц.ТаблицаПроводок;
	
	НС = ТаблицаПроводок.Добавить();
	НС.Комплект				= Комплект; 
	
	СтрокаСостояния = ТаблицаСтатусов.Найти(Комплект, "Комплект");
	Если НЕ СтрокаСостояния = Неопределено Тогда
		
		НС.ПредыдущийСостояние 	= СтрокаСостояния.Состояние;
		НС.ПредыдущийСтатус 	= СтрокаСостояния.Статус;
		НС.ПредыдущийТипЗадачи 	= СтрокаСостояния.ТипЗадачи;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущиеСтатусы(ТаблицаКомплектыИзделия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Задача КАК Задача,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ КАК Комплект,
		|	ТаймингЗадачСрезПоследних.Состояние КАК Состояние,
		|	ТаймингЗадачСрезПоследних.Статус КАК Статус,
		|	ТаймингЗадачСрезПоследних.ТипЗадачи КАК ТипЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних(&ДатаПриостановки, Задача.ОбъектТЗ В (&ОбъектТЗ)) КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	НЕ ТаймингЗадачСрезПоследних.Задача.Выполнена";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 			ТаблицаКомплектыИзделия.ВыгрузитьКолонку("ИзделиеКомплект"));
	Запрос.УстановитьПараметр("ДатаПриостановки", 	ДатаПриостановки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
